[Admin user Creation]
action.create_alert = 1
action.create_alert.param.template = 672fa4f48fa9cb64eb034937
action.create_alert.param.title = Admin User Creation
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
description = Détection de l’ajout d’utilisateurs dans des groupes privilégiés par des comptes non administratifs
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=connectix sourcetype=WinEventLog EventCode=4728 OR EventCode=4732 OR EventCode=4756 | search NOT Account_Name IN ("frank", "olivia", "alice", "yara", "david", "katherine", "uma") | stats count by host,Account_Name, Account_Domain, ComputerName

[Alerte d’utilisation des privilèges sensibles]
action.create_alert = 1
action.create_alert.param.template = 672fb0498fa9cb64eb034949
action.create_alert.param.title = Utilisation des privilèges sensibles
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" sourcetype="WinEventLog"  EventCode=4673 Privilege_List IN ("SeSecurityPrivilege", "SeBackupPrivilege", "SeRestorePrivilege", "SeTakeOwnershipPrivilege")

[Connexion avec credentials explicites]
action.create_alert = 1
action.create_alert.param.template = 672fb4ef8fa9cb64eb034954
action.create_alert.param.title = Connexion avec credentials explicites
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","action"]
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=4648\
NOT (Account_Name="frank" OR Account_Name="olivia")\
NOT Process_Name="C:\Windows\System32\lsass.exe"

[Suppression de journaux de sécurité Windows]
action.create_alert = 1
action.create_alert.param.template = 672fb7098fa9cb64eb034958
action.create_alert.param.title = Suppression de journaux de sécurité Windows
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","action"]
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=1102

[Ticket Kerberos venant d’un port ou d’une plage d’IP inattendue]
action.create_alert = 1
action.create_alert.param.template = 672fb6ca8fa9cb64eb034957
action.create_alert.param.title = Ticket Kerberos venant d’un port ou d’une plage d’IP inattendue
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","action"]
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=4768\
(where NOT match(Client_Address, "(::ffff:)?192\.168\.\d{1,3}\.\d{1,3}")\
OR (Client_Port > 0 AND Client_Port < 1024))

[Échecs de connexion récurrents]
action.create_alert = 1
action.create_alert.param.template = 672fb6488fa9cb64eb034956
action.create_alert.param.title = Échecs de connexion récurrents
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","action"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" (EventCode=4625 OR EventCode=4771) earliest_time=-60m@m latest_time=now\
| stats count by Account_Name\
| where count > 5

[Énumération des groupes d’un utilisateur]
action.create_alert = 1
action.create_alert.param.template = 672fb7698fa9cb64eb03495a
action.create_alert.param.title = Énumération des groupes d’un utilisateur
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","action"]
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=4798

[Cert]
action.create_alert = 1
action.create_alert.param.template = 672fa6008fa9cb64eb03493b
action.create_alert.param.title = cert
action.webhook.enable_allowlist = 0
alert.expires = 8d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */15 * * * *
description = Surveillance des Utilisations Anormales de CertUtil
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix"  EventCode=1 Image="*\certutil.exe" (CommandLine="* -urlcache*" OR CommandLine="* -split*")

[Connexion Hors Plage Horaire Normale]
action.create_alert = 1
action.create_alert.param.template = 672fa2948fa9cb64eb03492e
action.create_alert.param.title = Connexion Hors Plage Horaire Normale
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix"  sourcetype="WinEventLog" EventCode=4624 \
| eval hour=strftime(_time, "%H") \
| where hour < 6 OR hour >=20

[Decouverte process en cours]
action.create_alert = 1
action.create_alert.param.template = 672fd3008fa9cb64eb034986
action.create_alert.param.title = Decouverte process en cours
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Identifie les processus d’interrogation des tâches actives, souvent utilisés pour découvrir des programmes en cours.
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.page.search.mode = verbose
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=connectix source="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1 \
(Image="*\\tasklist.exe" OR Image="*\\ps.exe" OR (Image="*\\powershell.exe" CommandLine="*Get-Process*"))

[Détection d'injéction de code]
action.create_alert = 1
action.create_alert.param.template = 672f7c778fa9cb64eb03490c
action.create_alert.param.title = Injection
action.webhook.enable_allowlist = 0
alert.expires = 8d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Détection d'injéction de code
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index='connectix' EventCode=10

[Détection de Changements dans les Clés de Registre de Persistance]
action.create_alert = 1
action.create_alert.param.template = 672f84e28fa9cb64eb034924
action.create_alert.param.title = Détection de Changements dans les Clés de Registre de Persistance
action.webhook.enable_allowlist = 0
alert.expires = 8d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index='connectix' EventCode=13 TargetObject="*\Software\Microsoft\Windows\CurrentVersion\Run*"

[Détection_Changements_Clés_Registre_de_persistance]
action.create_alert = 1
action.create_alert.param.template = 672fbab48fa9cb64eb03495c
action.create_alert.param.title = Change_clé
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Détection de Changements dans les Clés de Registre de Persistance
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=connectix EventCode=13 TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*"

[Détection_Exécution_Fichier_Répertoires_Temp]
action.create_alert = 1
action.create_alert.param.template = 672fa38a8fa9cb64eb034931
action.create_alert.param.title = Detect_Temp
action.webhook.enable_allowlist = 0
alert.expires = 8d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=4688 New_Process_Name="*\\Temp\\*.exe"\
| stats count, values(Creator_Process_Name) AS Creator_Process_Name BY New_Process_Name\
| table New_Process_Name, count, Creator_Process_Name

[Firewall Rule Modification Detection]
action.create_alert = 1
action.create_alert.param.template = 672fc2bd8fa9cb64eb03496a
action.create_alert.param.title = Firewall Rule Modification Detection
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix"  sourcetype="WinEventLog" EventCode=4946

[Installation de service suspecte]
action.create_alert = 1
action.create_alert.param.template = 672fc7578fa9cb64eb034973
action.create_alert.param.title = installation de service suspecte
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 30h
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=connectix EventCode=4697\
Service_File_Name!="C:\\Windows\\system32\\*"\
Service_File_Name!="\\SystemRoot\\system32\\*"\
Service_File_Name!="C:\\Program Files\\*"\
Service_File_Name!="\\SystemRoot\\Program Files\\*"\
Service_File_Name!="C:\\Program Files (x86)\\*"\
Service_File_Name!="\\SystemRoot\\Program Files (x86)\\*"

[Log Disabled]
action.create_alert = 1
action.create_alert.param.template = 672fb72a8fa9cb64eb034959
action.create_alert.param.title = Log Disabled
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Surveiller la désactivation des journaux de sécurité, souvent utilisée pour masquer des activités malveillantes
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" sourcetype="WinEventLog" EventCode=1100

[Multiples commandes d'enumeration]
action.create_alert = 1
action.create_alert.param.template = 672fc9b18fa9cb64eb034976
action.create_alert.param.title = multiple enum commands
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 8d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=connectix EventCode=1\
(  Image="C:\\Windows\\*\\hostname.exe"\
OR Image="C:\\Windows\\*\\ipconfig.exe"\
OR Image="C:\\Windows\\*\\net.exe"\
OR Image="C:\\Windows\\*\\quser.exe"\
OR Image="C:\\Windows\\*\\qwinsta.exe"\
OR (Image="C:\\Windows\\*\\sc.exe" AND (CommandLine="* query *" OR CommandLine="* qc *"))\
OR Image="C:\\Windows\\*\\systeminfo.exe"\
OR Image="C:\\Windows\\*\\tasklist.exe"\
OR Image="C:\\Windows\\*\\wmic.exe"\
OR Image="C:\\Windows\\*\\whoami.exe")\
|  bin span=1h _time\
| stats count as NbHits, values(Image) as Process values(CommandLine) as CommandLines, \
values(ProcessGuid) as ProcessGuids, values(ParentImage) as ParentProcess\
by ComputerName, _time, User, Sid\
| where NbHits>2

[Permission Change in Database server]
action.create_alert = 1
action.create_alert.param.template = 672fa2a28fa9cb64eb03492f
action.create_alert.param.title = Permission Change in Database server
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Monitors database permission modifications, which may indicate attempts to elevate privileges or unauthorized access.
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=4670 Computer_Name="SRV-PRD-DB.connectix.net"

[Planified Task]
action.create_alert = 1
action.create_alert.param.template = 672fc4698fa9cb64eb03496c
action.create_alert.param.title = Planified task
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Détecter les tâches planifiées créées par des utilisateurs sans privilèges administratifs, signe potentiel de persistance.
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" sourcetype="WinEventLog" source="WinEventLog:Security" EventCode=4698 \
| search NOT Account_Name IN ("frank", "olivia", "alice", "yara", "david", "katherine", "uma", "SRV-PRD-DC$", "SRV-PRD-WEB$", "SRV-PRD-DB$", "SRV-PRD-SHARE$")

[Potential Malicious activity]
action.create_alert = 1
action.create_alert.param.template = 672fd0e98fa9cb64eb03497f
action.create_alert.param.title = Potential Malicious activity
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = utiliser cmd , powershell ou wmic plus de 5 fois sur un compte non admin
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" sourcetype="WinEventLog" \
(EventCode=4688 OR EventCode=4672) \
(New_Process_Name="*powershell.exe" OR New_Process_Name="*wmic.exe" OR New_Process_Name="*cmd.exe") \
| eval suspicious_process=case(\
    like(New_Process_Name, "%powershell.exe%"), "PowerShell",\
    like(New_Process_Name, "%wmic.exe%"), "WMIC",\
    like(New_Process_Name, "%cmd.exe%"), "Command Prompt",\
    true(), "Other"\
) \
| search NOT Account_Name IN ("frank", "olivia", "alice", "yara", "david", "katherine", "uma", "SRV-PRD-DC$", "SRV-PRD-WEB$", "SRV-PRD-DB$", "SRV-PRD-SHARE$")\
| stats count by host, Account_Name, New_Process_Name, suspicious_process, ComputerName, _time, EventCode\
| where count > 5

[Supp_Account]
action.create_alert = 1
action.create_alert.param.template = 672fd9398fa9cb64eb034996
action.create_alert.param.title = Supp_account
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Alerte declenché lors de suppression d un account
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=connectix EventCode=4726\
| table _time, Account_Name, Target_Account_Name, Subject_User_Name, Subject_Domain_Name

[Potentially Suspicious Self Extraction Directive File Created]
action.create_alert = 1
action.create_alert.param.template = 6730e1058fa9cb64eb034a61
action.create_alert.param.title = Potentially Suspicious Self Extraction Directive File Created
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Detects the creation of a binary file with the ".sed" extension.
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","EventCode"]
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=11 TargetFilename="*.sed"

[Suspicious file share access attempt by unauthorized account]
action.create_alert = 1
action.create_alert.param.template = 672fdaa98fa9cb64eb03499b
action.create_alert.param.title = Suspicious file share access attempt by unauthorized account
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix"  sourcetype=WinEventLog EventCode=5140\
| search NOT (Account_Name IN ("Zane", "Yara", "Ethan", "Scott", "David", "Noah", "Samuel", "Wila", "Alice", "Katherine", "Victor", "Lee", "Taylor", "Frank", "Olivia", "Uma","SRV-PRD-WEB$", "SRV-PRD-DB$", "SRV-PRD-SHARE$","SRV-PRD-DC$" ))

[System Security Policy Change Detection]
action.create_alert = 1
action.create_alert.param.template = 672f9d158fa9cb64eb034929
action.create_alert.param.title = System Security Policy Change Detection
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix"  sourcetype="WinEventLog"  EventCode=4719

[Unauthorized Access to System32 Files]
action.create_alert = 1
action.create_alert.param.template = 672faef88fa9cb64eb034947
action.create_alert.param.title = Unauthorized Access to System32 Files
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = This rule detects access attempts to files within the System32 other than read-only wich may indicate unauthorized attempts to modify critical system files.
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=4663 \
| search Object_Name="*\\System32\\*" Access_Mask!="0x10"

[Upload Web volumineux]
action.create_alert = 1
action.create_alert.param.template = 672fc8d28fa9cb64eb034975
action.create_alert.param.title = Upload Web volumineux
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Cette règle détecte les transferts de données sortantes supérieurs à 1Go dans un intervalle de 10 minutes.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix"\
| where http_method="POST" OR http_method="PUT"\
| bucket _time span=10m\
| stats sum(bytes_out) as total_bytes_out by _time, src_ip, dest_ip\
| where total_bytes_out > 100000000\
| table _time, src_ip, dest_ip, total_bytes_out

[User Creation]
action.create_alert = 1
action.create_alert.param.template = 672f62d68fa9cb64eb034828
action.create_alert.param.title = User creation
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = se déclenche si un user a été créé
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" sourcetype="WinEventLog" source="WinEventLog:Security" EventCode=4720 \
| rex field=_raw "Account Name:\s+(?<NewAccountName>[^\r\n]+)"\
| search NewAccountName!=""

[suricata alert]
action.create_alert = 1
action.create_alert.param.template = 672fd5748fa9cb64eb034991
action.create_alert.param.title = suricata alert
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 8d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=connectix sourcetype=suricata event_type=alert

[Failed Login Due to Expired Password]
action.create_alert = 1
action.create_alert.param.template = 672fa6198fa9cb64eb03493c
action.create_alert.param.title = Failed Login Due to Expired Password on $result.Computer_Name$
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Identifies failed login attempts due to expired passwords, which may indicate user negligence or missed password reset reminders.
dispatch.earliest_time = -1d
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="connectix" EventCode=4625 \
| search FailureReason="%%2307"